In [1]:
# Importing dependencies

import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import types

In [2]:
# Creating the database engine

engine = create_engine('postgresql+psycopg2://postgres:password@localhost/cafe_db')

In [3]:
# Reading the csv file

cafe_df = pd.read_csv('cafe_data.csv')

In [4]:
cafe_df.head()

,cust_id,store_ID,cust_gender,cust_age,cust_income,cust_q1_taste,cust_q2_price,cust_q3_calories,month,day,...,drink_milk,drink_calories,drink_price,food_type,food_calories,food_price,total_spend,comp_med,comp_big,comp_ind
0,3923,501,1,26.0,NaN,4,4,1,4,5,...,NaN,5,2.05,Grand Slam Cookie,280,2.00,4.05,1,0,1
1,4389,501,0,34.0,11190.0,1,4,1,1,26,...,NaN,4,1.75,Rice Krispie Square,240,1.95,3.70,1,0,1
2,20984,501,0,46.0,91292.0,5,5,1,9,4,...,NaN,5,2.05,NaN,0,NaN,2.05,1,0,1
3,6776,501,1,47.0,89551.0,3,4,2,6,23,...,NaN,5,2.05,NaN,0,NaN,2.05,1,0,1
4,16515,501,1,43.0,64310.0,4,3,2,11,25,...,NaN,0,NaN,Biscotti,280,2.20,2.20,1,0,1

In [5]:
cafe_df.rename(columns={'store_ID': 'store_id'}, inplace=True)

In [7]:
# Creting a dataframe that holds the customer information 

customer_df = cafe_df[['cust_id',
 'cust_gender',
 'cust_age',
 'cust_income',
 'cust_q1_taste',
 'cust_q2_price',
 'cust_q3_calories']].drop_duplicates(subset=['cust_id'])
customer_df.head()

,cust_id,cust_gender,cust_age,cust_income,cust_q1_taste,cust_q2_price,cust_q3_calories
0,3923,1,26.0,NaN,4,4,1
1,4389,0,34.0,11190.0,1,4,1
2,20984,0,46.0,91292.0,5,5,1
3,6776,1,47.0,89551.0,3,4,2
4,16515,1,43.0,64310.0,4,3,2

In [8]:
# Creting a dataframe that holds the order information 


order_df = cafe_df[['cust_id',
 'store_id',
 'month',
 'day',
 'transaction',
 'food',
 'drink',
 'drink_type',
 'drink_size',
 'drink_milk',
 'drink_calories',
 'drink_price',
 'food_type',
 'food_calories',
 'food_price',
 'total_spend']]
order_df.head()

,cust_id,store_id,month,day,transaction,food,drink,drink_type,drink_size,drink_milk,drink_calories,drink_price,food_type,food_calories,food_price,total_spend
0,3923,501,4,5,6705,1,1,Drip Coffee,Medium,NaN,5,2.05,Grand Slam Cookie,280,2.00,4.05
1,4389,501,1,26,1627,1,1,Drip Coffee,Small,NaN,4,1.75,Rice Krispie Square,240,1.95,3.70
2,20984,501,9,4,16568,0,1,Drip Coffee,Medium,NaN,5,2.05,NaN,0,NaN,2.05
3,6776,501,6,23,11070,0,1,Drip Coffee,Medium,NaN,5,2.05,NaN,0,NaN,2.05
4,16515,501,11,25,21285,1,0,NaN,NaN,NaN,0,NaN,Biscotti,280,2.20,2.20

In [9]:
competitors_df = cafe_df[['store_id','comp_med','comp_big','comp_ind']].drop_duplicates(subset='store_id')
competitors_df

       store_id  comp_med  comp_big  comp_ind
0           501         1         0         1
6820        511         0         1         0
13649       523         1         0         1
20311       528         1         1         0
27185       540         1         0         0
33964       568         0         1         0
40999       570         1         1         0
47919       585         0         1         0

In [10]:
# Creating a table in the database for the customer information

customer_df.to_sql(
    name='customer_info',
    con=engine,
    index=False,
    dtype={
        'cust_id': types.INTEGER(),
        'cust_gender': types.INTEGER(),
        'cust_age': types.INTEGER(),
        'cust_income': types.INTEGER(),
        'cust_q1_taste': types.INTEGER(),
        'cust_q2_price': types.INTEGER(),
        'cust_q3_calories': types.INTEGER()
        })

In [11]:
# Creating a table in the database for the order information

order_df.to_sql(
    name='order_info',
    con=engine,
    index=False,
    dtype={
        'cust_id': types.INTEGER(),
        'store_id': types.INTEGER(),
        'month': types.INTEGER(),
        'day': types.INTEGER(),
        'transaction': types.INTEGER(),
        'food': types.INTEGER(),
        'drink': types.INTEGER(),
        'drink_type': types.String(),
        'drink_size': types.String(),
        'drink_milk': types.String(),
        'drink_calories': types.INTEGER(),
        'drink_price': types.Float(),
        'food_type': types.String(),
        'food_calories': types.INTEGER(),
        'food_price': types.Float(),
        'total_spend': types.Float()
        })

In [12]:
# Creating a table in the database for the competitors

competitors_df.to_sql(
    name='competitors',
    con=engine,
    index=False,
    dtype={
        'store_id': types.INTEGER(),
        'comp_med': types.INTEGER(),
        'comp_big': types.INTEGER(),
        'comp_ind': types.INTEGER(),
        })

In [13]:
engine.execute("ALTER TABLE customer_info ADD PRIMARY KEY (cust_id)")

In [14]:
engine.execute("ALTER TABLE competitors ADD PRIMARY KEY (store_id)")

In [15]:
engine.execute("ALTER TABLE order_info ADD PRIMARY KEY (transaction)")
engine.execute("ALTER TABLE order_info ADD FOREIGN KEY (cust_id) REFERENCES customer_info (cust_id)")
engine.execute("ALTER TABLE order_info ADD FOREIGN KEY (store_id) REFERENCES competitors (store_id)")